

class BuyModel:
    def __init__(self):
        
        self.data = [
            # [facname, time, productcode, price, quantity, discount, total price]
            ['عمر خالد', '2025-04-21 20:54:29', '1003', 500, 50, 1, 24750.0],
            ['علاء احمد', '2025-04-21 21:54:29', '1001', 500, 210, 1, 103950.0],
            ['علاء احمد', '2025-04-21 22:54:29', '1005', 500, 20, 1, 9900.0],
            ['علاء احمد', '2025-04-21 19:54:29', '1003', 500, 200, 1, 99000.0],
            ['علاء احمد', '2025-04-21 20:52:29', '1003', 500, 40, 1, 19800.0],
            ['علاء احمد', '2025-04-21 20:54:29', '1003', 500, 50, 1, 24750.0],
            ['حمادة عمير', '2025-04-21 21:54:29', '1001', 500, 210, 1, 103950.0],
            ['علاء احمد', '2025-04-21 22:54:29', '1005', 500, 20, 1, 9900.0],
            ['علاء احمد', '2025-04-21 19:54:29', '1003', 500, 200, 1, 99000.0],
            ['علاء احمد', '2025-04-21 20:52:29', '1003', 500, 40, 1, 19800.0],
            ['علاء احمد', '2025-04-21 20:54:29', '1003', 500, 50, 1, 24750.0],
            ['علاء احمد', '2025-04-21 21:54:29', '1001', 500, 210, 1, 103950.0],
            ['علاء احمد', '2025-04-21 22:54:29', '1005', 500, 20, 1, 9900.0],
            ['علاء احمد', '2025-04-21 19:54:29', '1003', 500, 200, 1, 99000.0],
            ['علاء احمد', '2025-04-21 20:52:29', '1003', 500, 40, 1, 19800.0]
        ]
        print('here is buy model')
    
    def get_factory_names(self):
        # instead of that should write the query 
        
        return ["جلوبال تك للتصنيع", "حلول الروبوتات الدقيقة", "المنتجات البيئية الدائمة الخضرة", "صناعات الابتكار التقني", "أعمال الأتمتة العليا", "مصنع التصنيع الديناميكي", "مركز اللوجستيات الموحد", "أعمال الصلب النجمية", "ابتكارات المستقبل المزدهرة", "مجمع الهندسة النخبة", "مطاحن جراند سنترال", "منشأة الإنتاج الرئيسية", "أنظمة ستريملاين إنك", "بضائع الجودة الكمية", "سلسلة التوريد التآزرية", "مشاريع فانجارد المحدودة", "الصناعات الثقيلة هارموني", "مواد الجيل القادم المركبة", "مصنع البلاستيك بيكنكل", "الطاقة المتجددة المشرقة", "حلول الحالة الصلبة", "شركة تيتانيوم للتقنيات", "مؤسسة المرافق العالمية", "أعمال رؤية الرأس", "المستودعات العالمية", "زينيث بلا نفايات", "خطوط التجميع ألفا", "أعمال بيتا للتكنولوجيا الحيوية", "مجموعة غاما للمعدات", "أجهزة دلتا الرقمية"]


    def get_products_ids(self):
        # instead of that should write the query 
        
        return [i for i in range(1001, 1051)]

    def insert_buys_to_db(self, buys):
        for buy in buys:
            self.data.append(buy)
        # instead of that loop should write the query 
        print(f"this is buys added: \n{buys}")
        return True

    def get_buys_from_db(self ):
        # instead of that should write the query 
        
        return self.data